import cities


HELLO_MESSAGE = """Здравствуйте!

Вас приветствует команда Стандарт Экспресс!
Мы предоставляем разовую и постоянную работу.

Для того, чтобы мы могли предоставить Вам работу, нужно ответить на несколько вопросов и выполнить пару простых действий.
Это займет всего 2-3 минуты. 
После этого Вы будете добавлены в группу куда поступают заказы. 

Если готовы напишите слово «да»"""

HELLO_MESSAGE_BUTTONS = ['Да']

NAME_REQUEST = """Напишите Ваше имя"""
AGE_REQUEST = """Сколько вам полных лет?"""

PHONE_REQUEST = """Напишите ваш номер телефона

Пример:
+79001112233"""

CITY_REQUEST = """Напишите, пожалуйста, название города, в котором вы находитесь"""

TELEGRAM_REQUEST = """Чтобы получить первый заказ и начать зарабатывать Вам нужно скачать приложение «Telegram». 
Все заказы отправляются через это приложение в телеграмм группу, туда поступают заявки от наших диспетчеров, внимательно читаете условия, если Вас все устраивает, ставите знак «+», выполняете работу, получаете оплату сразу после выполнения работ.
Выплаты от 200 руб./час в зависимости от сложности, расстояния, времени суток. 

Вот ссылка для скачивания:  
iOS 
https://apps.apple.com/ru/app/telegram/id686449807

Android
https://play.google.com/store/apps/details?id=org.telegram.messenger&hl=ru&gl=US

Если у вас уже установлено приложение, напишите "Далее"
"""
TELEGRAM_REQUEST_BUTTONS = ['Далее']

CHECK_INFO_BUTTONS = ['Да', 'Нет']


def check_info(member):
    city = cities.api.get_city_by_id(member.city_id)
    message = f"""Ваши данные:
ФИО: {member.name} 
Возраст: {member.age}
Город: {city.name}
Телефон: +7{member.phone}

Проверьте корректность всех данных. 

Напишите "Да", если всё верно или "Нет", если есть ошибка"""
    return message


def send_link(link):
    message = f"""Ваша ссылка на вступление в группу:
{link.link}

Вступите в группу и ожидайте заказы."""
    return message


def send_moscow_link(link):
    message = f"""А так же обязательно вступайте в группу по Москве. 
Ваши города находятся рядом, если будет удобно, будете брать заявки и оттуда 

Ваша ссылка на вступление в группу по Москве:
{link.link}"""
    return message


def send_spb_link(link):
    message = f"""А так же обязательно вступайте в группу по Санкт-Петербургу. 
Ваши города находятся рядом, если будет удобно, будете брать заявки и оттуда 

Ваша ссылка на вступление в группу по Санкт-Петербургу:
{link.link}"""
    return message